---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.Velocity
source: html/a0c3ea9b-d49c-fd58-5cba-245b5f5ff6ed.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.Velocity Property

The velocity of the pipe. Units: (ft/s) .

## Syntax (C#)
```csharp
public double Velocity { get; set; }
```